### 6.3数据转换

#### 6.3.1删除重复元素

In [22]:
import pandas as pd
import numpy as np

In [3]:
dframe = pd.DataFrame({'colot':['white','white','red','red','white'],
                      'value':[2,1,3,3,2]})
dframe

   colot  value
0  white      2
1  white      1
2    red      3
3    red      3
4  white      2

重复行返回true

In [4]:
dframe.duplicated()

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [9]:
dframe[~dframe.duplicated()]

   colot  value
0  white      2
1  white      1
2    red      3

删除完全所有columns的值一样的行

In [8]:
dframe.drop_duplicates()

   colot  value
0  white      2
1  white      1
2    red      3

#### 6.3.2映射

replace，用映射替换元素`

In [11]:
frame = pd.DataFrame({'item':['ball','mug','pen','pencil','ashtray'],
                     'color':['white','rosso','verde','balck','yellow'],
                     'price':[5.56,4.20,1.30,0.56,2.75]})
frame

      item   color  price
0     ball   white   5.56
1      mug   rosso   4.20
2      pen   verde   1.30
3   pencil   balck   0.56
4  ashtray  yellow   2.75

In [15]:
newcolors = {
    'rosso':'red',
    'verde':'green'
}
frame.replace(newcolors)

      item   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   balck   0.56
4  ashtray  yellow   2.75

In [16]:
ser = pd.Series([1,3,np.nan,4,6,np.nan,3])
ser

0    1.0
1    3.0
2    NaN
3    4.0
4    6.0
5    NaN
6    3.0
dtype: float64

In [18]:
ser.replace(np.nan,0)

0    1.0
1    3.0
2    0.0
3    4.0
4    6.0
5    0.0
6    3.0
dtype: float64

用映射添加元素

In [19]:
frame = pd.DataFrame({'item':['ball','mug','pen','pencil','ashtray'],
                     'color':['white','red','green','black','yellow']})
frame

      item   color
0     ball   white
1      mug     red
2      pen   green
3   pencil   black
4  ashtray  yellow

In [21]:
price = {
    'ball':5.56,
    'mug':4.20,
    'bottle':1.30,
    'scissors':3.41,
    'pen':1.30,
    'pencil':0.56,
    'ashtray':2.75
}

map()将字典对象作为参数，这里在'item'这一列作映射，为frame添加price列

In [23]:
frame['price']=frame['item'].map(price)
frame

      item   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

重命名轴索引,使用rename()函数，以字典作为参数

In [25]:
reindex={
    0:'first',
    1:'second',
    2:'third',
    3:'forth',
    4:'fifth'
}
frame.rename(reindex)

           item   color  price
first      ball   white   5.56
second      mug     red   4.20
third       pen   green   1.30
forth    pencil   black   0.56
fifth   ashtray  yellow   2.75

重命名columns，必须使用column选项

In [28]:
recolumn = {
    'item':'object',
    'price':'value'
}
frame.rename(index=reindex,columns=recolumn)

         object   color  value
first      ball   white   5.56
second      mug     red   4.20
third       pen   green   1.30
forth    pencil   black   0.56
fifth   ashtray  yellow   2.75

替换单个元素，对参数进行限定,inplace=True,调用函数本身

In [33]:
frame.rename(index={1:'first'},columns={'item':'object'},inplace=True)
frame

        object   color  price
0         ball   white   5.56
first      mug     red   4.20
2          pen   green   1.30
3       pencil   black   0.56
4      ashtray  yellow   2.75

### 6.4离散化和面元划分

将面元划分为几个类,cut()返回对象为Categorical类型，其元素为labels名称.

In [34]:
results = [12,34,67,55,28,90,99,12,3,56,74,44,87,23,49,89,87]
bins = [0,25,50,75,100]

In [44]:
cat  = pd.cut(results,bins,labels=["bad", "medium", "good","very good"])
cat

[bad, medium, good, good, medium, ..., very good, bad, medium, very good, very good]
Length: 17
Categories (4, object): [bad < medium < good < very good]

不指定面元的界限，传入整数，则划分为相应的几个部分，区间的上下限取决于样本数据

In [52]:
pd.cut(results,5)

[(2.904, 22.2], (22.2, 41.4], (60.6, 79.8], (41.4, 60.6], (22.2, 41.4], ..., (79.8, 99.0], (22.2, 41.4], (41.4, 60.6], (79.8, 99.0], (79.8, 99.0]]
Length: 17
Categories (5, interval[float64]): [(2.904, 22.2] < (22.2, 41.4] < (41.4, 60.6] < (60.6, 79.8] < (79.8, 99.0]]

qcut划分数量平均，区间不均匀

In [54]:
pd.qcut(results,5)

[(2.999, 24.0], (24.0, 46.0], (62.6, 87.0], (46.0, 62.6], (24.0, 46.0], ..., (62.6, 87.0], (2.999, 24.0], (46.0, 62.6], (87.0, 99.0], (62.6, 87.0]]
Length: 17
Categories (5, interval[float64]): [(2.999, 24.0] < (24.0, 46.0] < (46.0, 62.6] < (62.6, 87.0] < (87.0, 99.0]]

异常值检测和过滤

In [56]:
#描述每一列数据的统计量
randframe = pd.DataFrame(np.random.rand(1000,3))
randframe.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean      0.497689     0.496996     0.504675
std       0.290213     0.293180     0.284583
min       0.004499     0.000511     0.000380
25%       0.246382     0.233654     0.259936
50%       0.511884     0.501806     0.506554
75%       0.745283     0.745600     0.752022
max       0.999337     0.999716     0.999251

过滤比标准差大三倍的数值，any()对每一列进行帅选

In [57]:
randframe[(np.abs(randframe)>(3*randframe.std())).any(1)]

            0         1         2
5    0.591645  0.942480  0.224901
12   0.465162  0.898096  0.800114
14   0.923721  0.963235  0.663051
16   0.083715  0.906367  0.366017
18   0.051531  0.904092  0.579889
24   0.422410  0.938171  0.817742
26   0.902189  0.032494  0.164093
31   0.791825  0.619183  0.861268
33   0.881867  0.952176  0.840647
35   0.967379  0.737288  0.259731
36   0.117520  0.907110  0.247058
37   0.386258  0.112621  0.892289
43   0.809827  0.663659  0.892008
47   0.707625  0.512734  0.969921
48   0.236662  0.953719  0.899417
49   0.290224  0.956112  0.423047
51   0.359279  0.396010  0.907883
54   0.343501  0.997290  0.163051
55   0.974707  0.543629  0.589682
57   0.302715  0.088578  0.992946
60   0.903292  0.048315  0.387766
61   0.177236  0.380860  0.937217
63   0.992224  0.675491  0.997846
64   0.931155  0.524061  0.511056
65   0.739449  0.525275  0.923508
68   0.900806  0.095143  0.177532
69   0.558919  0.919081  0.517689
70   0.345579  0.001139  0.864673
75   0.110598  0.428479  0.989803
76   0.695626  0.487140  0.982167
..        ...       ...       ...
932  0.602385  0.359030  0.929449
933  0.911264  0.940687  0.089661
935  0.370501  0.943628  0.250439
937  0.952718  0.246340  0.133749
938  0.651143  0.717683  0.974569
940  0.812485  0.218380  0.919046
941  0.977339  0.284741  0.715904
942  0.267179  0.954293  0.995369
943  0.016007  0.897929  0.872291
947  0.460389  0.976236  0.760072
948  0.017470  0.243280  0.987256
950  0.578933  0.959977  0.911867
952  0.725686  0.940959  0.267091
962  0.263013  0.543208  0.944555
963  0.547124  0.808006  0.933827
965  0.933938  0.528311  0.702559
968  0.093722  0.893288  0.720543
974  0.088482  0.901263  0.760805
977  0.473057  0.692365  0.936655
978  0.883775  0.549594  0.522015
985  0.882324  0.579189  0.865761
986  0.690338  0.966818  0.730823
987  0.950228  0.059095  0.503884
988  0.617039  0.868313  0.901294
990  0.768254  0.484961  0.951265
992  0.466257  0.004239  0.951345
993  0.503552  0.146034  0.880294
996  0.080014  0.062714  0.933669
997  0.943421  0.996260  0.849470
998  0.809457  0.985877  0.276737

[353 rows x 3 columns]

### 6.5排序

使用np.random.permutation()只包含0-4的随机数,进行各行的顺序的随机排序

In [59]:
nframe = pd.DataFrame(np.arange(25).reshape(5,5))
nframe

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [60]:
new_order = np.random.permutation(5)
new_order

array([1, 0, 3, 2, 4])

In [61]:
nframe.take(new_order)

    0   1   2   3   4
1   5   6   7   8   9
0   0   1   2   3   4
3  15  16  17  18  19
2  10  11  12  13  14
4  20  21  22  23  24

In [67]:
nframe.reindex(new_order)

    0   1   2   3   4
1   5   6   7   8   9
0   0   1   2   3   4
3  15  16  17  18  19
2  10  11  12  13  14
4  20  21  22  23  24

随机取样使用np.random.randint()

In [88]:
sample = np.random.randint(0,len(nframe),size = 3)
sample

array([2, 2, 2])

In [90]:
nframe.take(sample)

    0   1   2   3   4
2  10  11  12  13  14
2  10  11  12  13  14
2  10  11  12  13  14

### 6.6字符串处理

#### 内置字符串处理方法,spilt()分割字符串,strip()删除多余的空白符和换行符

In [2]:
text = '16 Bolton Avenue,Boston'
text.split(',')

['16 Bolton Avenue', 'Boston']

In [3]:
[s.strip() for s in text.split(',')]

['16 Bolton Avenue', 'Boston']

In [4]:
address,city = [s.strip() for s in text.split(',')]
address,city

('16 Bolton Avenue', 'Boston')

拼接字符串

In [5]:
address+','+city

'16 Bolton Avenue,Boston'

In [6]:
strings = ['A+','A','A-','B','B+','BBB','BB','C+']
';'.join(strings)

'A+;A;A-;B;B+;BBB;BB;C+'

In [7]:
text.find('Boston')

17

In [8]:
text.count('e')

2

In [10]:
text.replace('Avenue','street')

'16 Bolton street,Boston'

6.6.2正则表达式

In [11]:
import re

In [12]:
text = 'This is my address: 16 Botton Avenue,Bostton'
regex=re.compile('\s+')
regex.split(text)

['This', 'is', 'my', 'address:', '16', 'Botton', 'Avenue,Bostton']

In [13]:
regex = re.compile('A\w+')
re.findall(regex,text)

['Avenue']

In [20]:
regex = re.compile('[Aa]\w+')
re.findall(regex,text)

['address', 'Avenue']

### 6.7数据的聚合

6.7.1GroupBy

In [23]:
frame = pd.DataFrame({'color':['white','red','green','red','green'],
                     'object':['pen','pencil','pencil','ashtray','pen'],
                     'price1':[5.56,4.20,1.30,0.56,2.75],
                     'price2':[4.75,4.12,1.60,0.75,3.15]})
frame

   color   object  price1  price2
0  white      pen    5.56    4.75
1    red   pencil    4.20    4.12
2  green   pencil    1.30    1.60
3    red  ashtray    0.56    0.75
4  green      pen    2.75    3.15

In [25]:
#相同颜色的行分到了同一组
group = frame['price1'].groupby(frame['color'])
group

In [28]:
group.mean(),group.sum()

(color
 green    2.025
 red      2.380
 white    5.560
 Name: price1, dtype: float64, color
 green    4.05
 red      4.76
 white    5.56
 Name: price1, dtype: float64)

6.7.3等级分组

In [31]:
ggroup = frame['price1'].groupby([frame['color'],frame['object']])
ggroup

In [32]:
ggroup.mean(),ggroup.sum()

(color  object
 green  pen        2.75
        pencil     1.30
 red    ashtray    0.56
        pencil     4.20
 white  pen        5.56
 Name: price1, dtype: float64, color  object
 green  pen        2.75
        pencil     1.30
 red    ashtray    0.56
        pencil     4.20
 white  pen        5.56
 Name: price1, dtype: float64)

In [35]:
frame[['price1','price2']].groupby([frame['color'],frame['object']]).mean()

               price1  price2
color object
green pen        2.75    3.15
      pencil     1.30    1.60
red   ashtray    0.56    0.75
      pencil     4.20    4.12
white pen        5.56    4.75

In [41]:
frame.groupby(frame['color']).mean()

       price1  price2
color
green   2.025   2.375
red     2.380   2.435
white   5.560   4.750

### 组迭代

In [39]:
for name,group in frame.groupby(frame['color']):
    print(name)
    print(group)

green
   color  object  price1  price2
2  green  pencil    1.30    1.60
4  green     pen    2.75    3.15
red
  color   object  price1  price2
1   red   pencil    4.20    4.12
3   red  ashtray    0.56    0.75
white
   color object  price1  price2
0  white    pen    5.56    4.75

6.8.1链式转换

In [42]:
frame['price1'].groupby(frame['color']).mean()

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [43]:
frame.groupby(frame['color'])['price1'].mean()

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [44]:
(frame.groupby(frame['color']).mean())['price1']

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [47]:
means = frame.groupby('color').mean().add_prefix('mean_')
means

       mean_price1  mean_price2
color
green        2.025        2.375
red          2.380        2.435
white        5.560        4.750

6.8.2 分组函数

In [48]:
##运用GroupBY对象获得Series结构数据，进行运算
group = frame.groupby(frame['color'])
group['price1'].quantile(0.6)

color
green    2.170
red      2.744
white    5.560
Name: price1, dtype: float64

In [49]:
#自定义聚合函数，定义好函数后，将其作为参数传递给agg()函数
def range(series):
    return series.max() - series.min()

In [52]:
group['price1'].agg(range)

color
green    1.45
red      3.64
white    0.00
Name: price1, dtype: float64

In [53]:
group.agg(range)

       price1  price2
color
green    1.45    1.55
red      3.64    3.37
white    0.00    0.00

In [55]:
#同时使用多个聚合操作函数
group['price1'].agg(['mean','std',range])

        mean       std  range
color
green  2.025  1.025305   1.45
red    2.380  2.573869   3.64
white  5.560       NaN   0.00

### 6.9高级聚合函数

In [58]:
sums = frame.groupby('color').sum().add_prefix('tot_')
sums

       tot_price1  tot_price2
color
green        4.05        4.75
red          4.76        4.87
white        5.56        4.75

In [64]:
pd.merge(frame,sums,left_on='color',right_index=True)

   color   object  price1  price2  tot_price1  tot_price2
0  white      pen    5.56    4.75        5.56        4.75
1    red   pencil    4.20    4.12        4.76        4.87
3    red  ashtray    0.56    0.75        4.76        4.87
2  green   pencil    1.30    1.60        4.05        4.75
4  green      pen    2.75    3.15        4.05        4.75

In [65]:
#使用transform（）更适合局和操作
frame.groupby('color').transform(np.sum).add_prefix('tot_')

      tot_object tot_price1 tot_price2
0            pen       5.56       4.75
1  pencilashtray       4.76       4.87
2      pencilpen       4.05       4.75
3  pencilashtray       4.76       4.87
4      pencilpen       4.05       4.75

In [68]:
frame.groupby([frame['object'],frame['color']]).apply(lambda x :x.max())

               color   object  price1  price2
object  color
ashtray red      red  ashtray    0.56    0.75
pen     green  green      pen    2.75    3.15
        white  white      pen    5.56    4.75
pencil  green  green   pencil    1.30    1.60
        red      red   pencil    4.20    4.12